apache/nuttx/arch/arm/src/stm32l4/stm32l4_sai.c
/* Buffer container helpers */

static struct sai_buffer_s *
                sai_buf_allocate(struct stm32_sai_s *priv);
static void     sai_buf_free(struct stm32_sai_s *priv,
                  struct sai_buffer_s *bfcontainer);
static void     sai_buf_initialize(struct stm32_sai_s *priv);

/* DMA support */

#ifdef CONFIG_STM32_SAI_DMA
static void     sai_schedule(struct stm32_sai_s *priv, int result);
static void     sai_dma_callback(DMA_HANDLE handle, uint8_t isr, void *arg);
#endif

/* I2S methods */

static int32_t  sai_samplerate(struct i2s_dev_s *dev, uint32_t rate);
static int32_t  sai_datawidth(struct i2s_dev_s *dev, int bits);
static int      sai_receive(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                  i2s_callback_t callback, void *arg, uint32_t timeout);
static int      sai_send(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                  i2s_callback_t callback, void *arg,
                  uint32_t timeout);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* I2S device operations */

static const struct i2s_ops_s g_i2sops =
{
  /* Receiver methods */

  .i2s_rxsamplerate = sai_samplerate,
  .i2s_rxdatawidth  = sai_datawidth,
  .i2s_receive      = sai_receive,

  /* Transmitter methods */

  .i2s_txsamplerate = sai_samplerate,
  .i2s_txdatawidth  = sai_datawidth,
  .i2s_send         = sai_send,
};

/* SAI1 state */

#ifdef CONFIG_STM32_SAI1_A
static struct stm32_sai_s g_sai1a_priv =
{
  .dev.ops     = &g_i2sops,
  .base        = STM32_SAI1_A_BASE,
  .lock        = NXMUTEX_INITIALIZER,
  .frequency   = STM32_SAI1_FREQUENCY,
#ifdef CONFIG_STM32_SAI1_A_SYNC_WITH_B
  .syncen      = SAI_CR1_SYNCEN_SYNC_INT,
#else
  .syncen      = SAI_CR1_SYNCEN_ASYNC,
#endif
#ifdef CONFIG_STM32_SAI_DMA
  .dma_ch      = DMACHAN_SAI1_A,
#endif
  .datalen     = CONFIG_STM32_SAI_DEFAULT_DATALEN,
  .samplerate  = CONFIG_STM32_SAI_DEFAULT_SAMPLERATE,
  .bufsem      = SEM_INITIALIZER(CONFIG_STM32_SAI_MAXINFLIGHT),
};
#endif

#ifdef CONFIG_STM32_SAI1_B
static struct stm32_sai_s g_sai1b_priv =
{
  .dev.ops     = &g_i2sops,
  .base        = STM32_SAI1_B_BASE,
  .lock        = NXMUTEX_INITIALIZER,
  .frequency   = STM32_SAI1_FREQUENCY,
#ifdef CONFIG_STM32_SAI1_B_SYNC_WITH_A
  .syncen      = SAI_CR1_SYNCEN_SYNC_INT,
#else
  .syncen      = SAI_CR1_SYNCEN_ASYNC,
#endif
#ifdef CONFIG_STM32_SAI_DMA
  .dma_ch      = DMACHAN_SAI1_B,
#endif
  .datalen     = CONFIG_STM32_SAI_DEFAULT_DATALEN,
  .samplerate  = CONFIG_STM32_SAI_DEFAULT_SAMPLERATE,
  .bufsem      = SEM_INITIALIZER(CONFIG_STM32_SAI_MAXINFLIGHT),
};
#endif

/* SAI2 state */

#ifdef CONFIG_STM32_SAI2_A
static struct stm32_sai_s g_sai2a_priv =
{
  .dev.ops     = &g_i2sops,
  .base        = STM32_SAI2_A_BASE,
  .lock        = NXMUTEX_INITIALIZER,
  .frequency   = STM32_SAI2_FREQUENCY,
#ifdef CONFIG_STM32_SAI2_A_SYNC_WITH_B
  .syncen      = SAI_CR1_SYNCEN_SYNC_INT,
#else
  .syncen      = SAI_CR1_SYNCEN_ASYNC,
#endif
#ifdef CONFIG_STM32_SAI_DMA
  .dma_ch      = DMACHAN_SAI2_A,
#endif
  .datalen     = CONFIG_STM32_SAI_DEFAULT_DATALEN,
  .samplerate  = CONFIG_STM32_SAI_DEFAULT_SAMPLERATE,
  .bufsem      = SEM_INITIALIZER(CONFIG_STM32_SAI_MAXINFLIGHT),
};
#endif

#ifdef CONFIG_STM32_SAI2_B
static struct stm32_sai_s g_sai2b_priv =
{
  .dev.ops     = &g_i2sops,
  .base        = STM32_SAI2_B_BASE,
  .lock        = NXMUTEX_INITIALIZER,
  .frequency   = STM32_SAI2_FREQUENCY,
#ifdef CONFIG_STM32_SAI2_B_SYNC_WITH_A
  .syncen      = SAI_CR1_SYNCEN_SYNC_INT,
#else
  .syncen      = SAI_CR1_SYNCEN_ASYNC,
#endif
#ifdef CONFIG_STM32_SAI_DMA
  .dma_ch      = DMACHAN_SAI2_B,
#endif
  .datalen     = CONFIG_STM32_SAI_DEFAULT_DATALEN,
  .samplerate  = CONFIG_STM32_SAI_DEFAULT_SAMPLERATE,
  .bufsem      = SEM_INITIALIZER(CONFIG_STM32_SAI_MAXINFLIGHT),
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: sai_getbitrate
 *
 * Description:
 *   Get the currently configured bitrate
 *
 * Input Parameters:
 *   priv   - private SAI device structure
 *
 * Returned Value:
 *   The current bitrate
 *
 ****************************************************************************/

static inline uint32_t sai_getbitrate(struct stm32_sai_s *priv)
{
  /* Calculate the bitrate in Hz */

  return priv->samplerate * priv->datalen;
}

/****************************************************************************
 * Name: sai_getreg
 *
 * Description:
 *   Get the contents of the SAI register at offset
 *
 * Input Parameters:
 *   priv   - private SAI device structure
 *   offset - offset to the register of interest
 *
 * Returned Value:
 *   The contents of the 32-bit register
 *
 ****************************************************************************/

static inline uint32_t sai_getreg(struct stm32_sai_s *priv, uint8_t offset)
{
  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: sai_putreg
 *
 * Description:
 *   Write a 16-bit value to the SAI register at offset
 *
 * Input Parameters:
 *   priv   - private SAI device structure
 *   offset - offset to the register of interest
 *   value  - the 32-bit value to be written
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void sai_putreg(struct stm32_sai_s *priv, uint8_t offset,
                              uint32_t value)
{
  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: sai_modifyreg
 *
 * Description:
 *   Clear and set bits in the SAI register at offset
 *
 * Input Parameters:
 *   priv    - private SAI device structure
 *   offset  - offset to the register of interest
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_modifyreg(struct stm32_sai_s *priv, uint8_t offset,
                          uint32_t clrbits, uint32_t setbits)
{
  uint32_t regval;

